[
    {
        "expression": "Frontend",
        "description_short": "Teil einer Software, der für die Darstellung von Benutzeroberflächen zuständig ist."
    },
    {
        "expression": "Backend",
        "description_short": "Teil einer Software, der für die Verarbeitung von Daten und die Steuerung der Logik im Hintergrund zuständig ist."
    },
    {
        "expression": "Skalierbarkeit",
        "description_short": "Fähigkeit einer Software oder eines Systems, mit wachsender Anzahl von Benutzern oder Datenmengen umzugehen und dabei eine hohe Performance aufrechtzuerhalten."
    },
    {
        "expression": "Pointer",
        "description_short": "Datentyp in der Programmierung, der eine Speicheradresse repräsentiert, an der ein Wert gespeichert ist."
    },
    {
        "expression": "SSH",
        "description_short": "Verschlüsseltes Netzwerkprotokoll, das eine sichere Kommunikation zwischen zwei Netzwerkgeräten ermöglicht."
    },
    {
        "expression": "Monorepo",
        "description_short": "Software-Entwicklungsansatz, bei dem alle Quellcode-Repositories eines Projekts in einem einzigen Repository organisiert werden."
    },
    {
        "expression": "MQTT",
        "description_short": "Leichtgewichtiges Netzwerkprotokoll für die Machine-to-Machine-Kommunikation, das auf dem Publish-Subscribe-Muster basiert."
    },
    {
        "expression": "MQTT-Broker",
        "description_short": "Server-Software, die das MQTT-Protokoll unterstützt und für die Vermittlung von Nachrichten zwischen MQTT-Clients zuständig ist."
    },
    {
        "expression": "Token",
        "description_short": "Kleiner Datensatz, der zur Identifikation und Authentifizierung von Benutzern oder Geräten in einem Computersystem verwendet wird."
    },
    {
        "expression": "Mac-Adresse",
        "description_short": "Eindeutige Kennung für Netzwerkgeräte, die zur Identifikation in einem Netzwerk verwendet wird und auf der physischen Hardware des Geräts gespeichert ist."
    },
    {
        "expression": "node.js",
        "description_short": "JavaScript-Runtime, die es ermöglicht, JavaScript-Code auf dem Server auszuführen und serverseitige Webanwendungen zu entwickeln."
    },
    {
        "expression": "Datenbank",
        "description_short": "System zur elektronischen Datenverwaltung, das es ermöglicht, strukturierte Daten effizient zu speichern, abzufragen und zu verwalten."
    },
    {
        "expression": "API",
        "description_short": "Programmierschnittstelle, die es Anwendungen ermöglicht, auf die Funktionen oder Daten einer anderen Anwendung oder Plattform zuzugreifen."
    },
    {
        "expression": "Port",
        "description_short": "Nummer, die einer bestimmten Netzwerkanwendung zugewiesen ist, um den Datenverkehr auf einem Computer oder Server zu identifizieren und zu organisieren."
    },
    {
        "expression": "TCP",
        "description_short": "A protocol for reliable transmission of data between applications over a network."
    },
    {
        "expression": "IP",
        "description_short": "A protocol that enables communication between devices over a network, by providing unique addresses for each device."
    },
    {
        "expression": "Payload",
        "description_short": "The actual data that is being transmitted over a network."
    },
    {
        "expression": "Typecasting",
        "description_short": "The process of converting a variable from one data type to another."
    },
    {
        "expression": "typsicher",
        "description_short": "A term used to describe programming languages or features that enforce type safety, which means that type errors are caught at compile time rather than runtime."
    }
]