[
    {
        "expression": "ROM",
        "complexity": 2,
        "description_short": "Read-Only Memory, ein Speichertyp, der nur lesbar ist und Daten auch ohne Stromversorgung behält."
    },
    {
        "expression": "Escape Character",
        "complexity": 2,
        "description_short": "Ein spezielles Zeichen, das in der Programmierung verwendet wird, um eine spezielle Bedeutung oder Funktion zu kennzeichnen, z.B. das Backslash-Zeichen '\\'."
    },
    {
        "expression": "CRUD",
        "complexity": 2,
        "description_short": "Akronym für Create, Read, Update, Delete - die grundlegenden Operationen zur Datenmanipulation in einer Datenbank oder einem Informationssystem."
    },
    {
        "expression": "UUID",
        "complexity": 3,
        "description_short": "Universally Unique Identifier, eine 128-Bit-Zeichenkette zur eindeutigen Identifizierung von Objekten oder Entitäten in Computersystemen."
    },
    {
        "expression": "noSQL-Datenbank",
        "complexity": 4,
        "description_short": "Eine Datenbank, die nicht auf dem relationalen Datenbankmodell basiert und keine festen Tabellenstruktur erfordert, sondern flexible Schemata und speicherbasierte Datenorganisation verwendet."
    },
    {
        "expression": "mongoDB Collection Methods",
        "complexity": 4,
        "description_short": "Funktionen und Methoden, die in der MongoDB-Datenbank verwendet werden, um Operationen wie das Einfügen, Aktualisieren oder Abfragen von Dokumenten in einer Sammlung durchzuführen."
    },
    {
        "expression": "Asynchrone Funktion",
        "complexity": 3,
        "description_short": "Eine Funktion, die asynchron ausgeführt wird und nicht blockiert, während sie auf das Ergebnis einer Operation oder eines Ereignisses wartet."
    },
    {
        "expression": "await",
        "complexity": 2,
        "description_short": "Ein Schlüsselwort in JavaScript, das innerhalb einer asynchronen Funktion verwendet wird, um auf das Ergebnis einer asynchronen Operation zu warten."
    },
    {
        "expression": "Quantenverschränkung",
        "complexity": 10,
        "description_short": "Ein Phänomen der Quantenphysik, bei dem zwei oder mehr Teilchen stark voneinander abhängig sind, selbst wenn sie räumlich voneinander getrennt sind."
    },
    {
        "expression": "Variable",
        "complexity": 1,
        "description_short": "Ein Symbol oder Name, der einen Speicherplatz repräsentiert und verwendet wird, um Werte oder Daten zu speichern und abzurufen."
    }
]